[
  {
    "question": "Whenever you first start an Android applinever you finever you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you never you first start an Android applinever you rst start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnevernever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android appnever you first start an Android app you first start an Android appnever you first start an Android appnever you first start an Android appcation, ggggmaa thread called \"main\" is automatically created. The main thread, also called the UI thread, is very important because it is in charge of dispatching the events to the appropriate widgets and this includes the drawing events. It is also the thread you interact with Android widgets on. For instance, if you touch the a button on screen, the UI thread dispatches the touch event to the widget which in turn sets its pressed state and posts an invalidate request to the event queue. The UI thread dequeues the request and notifies the widget to redraw itself.",
    "wrong": [
      "wrong one",
      "wrong two",
      "wrong three",
      "wrong four",
      "wrong five",
      "wrong six",
      "wrong seven",
      "wrong eightttttttttttttttttttttttttttttttttttttttttttttttttttt"
    ],
    "right": [
      "right answer one",
      "right answer two"
    ]
  },
  {
    "question": "first question is2",
    "wrong": [
      "one2",
      "two2",
      "three2"
    ],
    "right": [
      "just one2"
    ]
  }
]